<a href="https://colab.research.google.com/github/rileythejones/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [7]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-03 00:15:38--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.176.69
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.176.69|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  16.3MB/s    in 13s

2019-10-03 00:15:53 (14.5 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [8]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [9]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01

In [10]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd
d1 = pd.read_csv('order_products__prior.csv')
d2 = pd.read_csv('order_products__train.csv')
d3 = pd.read_csv('orders.csv')
d4 = pd.read_csv('products.csv')
d5 = pd.concat([d1, d2])

In [0]:
d6 = pd.merge(d5, d3, how='inner', on='order_id')

In [0]:
d7 = pd.merge(d6, d4, how='inner', on='product_id')

In [25]:
d7.head()

   order_id  product_id  ...  aisle_id  department_id
0         2       33120  ...        86             16
1        26       33120  ...        86             16
2       120       33120  ...        86             16
3       327       33120  ...        86             16
4       390       33120  ...        86             16

[5 rows x 13 columns]

In [0]:
d8 = d7[(d7['product_name'] == 'Banana') |
(d7['product_name'] == 'Bag of Organic Bananas') |
(d7['product_name'] == 'Organic Strawberries') |
(d7['product_name'] == 'Organic Baby Spinach') |
(d7['product_name'] == 'Organic Hass Avocado') |
(d7['product_name'] == 'Organic Avocado') |
(d7['product_name'] == 'Large Lemon') |
(d7['product_name'] == 'Strawberries') |
(d7['product_name'] == 'Limes') |
(d7['product_name'] == 'Organic Whole Milk')]

In [28]:
d8['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [43]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-03 02:12:01--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.113.69
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.113.69|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  17.1MB/s    in 13s

2019-10-03 02:12:15 (15.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [44]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [45]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01/instacart_2017_05_01

In [47]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [48]:

!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [50]:
import pandas as pd

order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)


order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)


orders = pd.read_csv('orders.csv')
print(orders.shape)


products = pd.read_csv('products.csv')
print(products.shape)

(32434489, 4)
(1384617, 4)
(3421083, 7)
(49688, 4)

In [52]:
order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)
order_products.head(5)

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# make sure that the shapes of these large dataframes match before proceeding
assert (order_products__prior.shape[0] +
        order_products__train.shape[0] == 
        order_products.shape[0])

In [59]:
display(example)

In [0]:
# condition for either order_id 
(order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)

In [0]:
# selecting with condition
order_products[(order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)].head(20)

In [0]:
# chaining conditions 
orders[orders['user_id'] == 1][orders['order_number'] <= 2]

In [0]:
# Merge dataframes

In [61]:
# selecting certain columns conditionally
condition = (orders['user_id'] == 1) & (orders['order_number'] <= 2)
columns = ['user_id', 
           'order_id', 
           'order_number', 
           'order_dow', 
           'order_hour_of_day']
orders_subset = orders.loc[condition, columns]

orders_subset.head()

   user_id  order_id  order_number  order_dow  order_hour_of_day
0        1   2539329             1          2                  8
1        1   2398795             2          3                  7

In [64]:
condition = (order_products['order_id'] == 2539329) |(order_products['order_id'] == 2398795)
columns = ['order_id', 
           'add_to_cart_order', 
           'product_id']
order_products_subset = order_products.loc[condition, columns]
order_products_subset.head(5)

          order_id  add_to_cart_order  product_id
22742744   2398795                  1         196
22742745   2398795                  2       10258
22742746   2398795                  3       12427
22742747   2398795                  4       13176
22742748   2398795                  5       26088

In [65]:
# Merge with columns from products on order_id
merged = pd.merge(orders_subset, order_products_subset, how='inner', on='order_id')

merged.head()

   user_id  order_id  ...  add_to_cart_order  product_id
0        1   2539329  ...                  1         196
1        1   2539329  ...                  2       14084
2        1   2539329  ...                  3       12427
3        1   2539329  ...                  4       26088
4        1   2539329  ...                  5       26405

[5 rows x 7 columns]

In [66]:
display(example)

In [70]:
# merge again on product_id
final = pd.merge(merged, products[['product_id', 'product_name']], how='inner', on='product_id')
final.head(3)

   user_id  order_id  ...  product_id                             product_name
0        1   2539329  ...         196                                     Soda
1        1   2398795  ...         196                                     Soda
2        1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk

[3 rows x 8 columns]

In [71]:
# sort 
final = final.sort_values(by=['order_number', 'add_to_cart_order'])
final.head(3)

   user_id  order_id  ...  product_id                             product_name
0        1   2539329  ...         196                                     Soda
2        1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3        1   2539329  ...       12427                      Original Beef Jerky

[3 rows x 8 columns]

In [72]:
# rename columns 
final.columns = [column.replace('_', ' ') for column in final]
final.head(3)

   user id  order id  ...  product id                             product name
0        1   2539329  ...         196                                     Soda
2        1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3        1   2539329  ...       12427                      Original Beef Jerky

[3 rows x 8 columns]

**Tidy Data**

In [0]:
# Hadley Wickham's Examples
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [122]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [123]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [119]:
# Table 1 --> Tidy
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [120]:
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [124]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [125]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [126]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [127]:
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [128]:
tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [0]:
# Table 2 --> Tidy
##### LEAVE BLANK --an assignment exercise #####

# don't do this, this is cheating
# table2.T.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

In [131]:
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [132]:
table2.index.tolist()

['treatmenta', 'treatmentb']

In [133]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [134]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [135]:
tidy2 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy2

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [136]:
tidy2 = tidy2.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy2

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [140]:
tidy2.trt = tidy.trt.str.replace('treatment', '')

tidy2

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [141]:
tidy2.T

                 0         1             2           3         4             5
name    John Smith  Jane Doe  Mary Johnson  John Smith  Jane Doe  Mary Johnson
trt              a         a             a           b         b             b
result         NaN        16             3           2        11             1

In [129]:
#Tidy --> Table 1
wide = tidy.pivot_table(index='name', columns='trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [138]:
# Tidy --> Table 2
wide2 = tidy2.pivot_table(index='name', columns='trt', values='result')
wide2

trt           treatmenta  treatmentb
name
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [0]:
import seaborn as sns 
flights = sns.load_dataset('flights')

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
# create a pivot table
# showing the number of passengers by month and year 
# use year for the index
# and month for columns 

p_table = pd.pivot_table(flights, index='year', columns='month')
p_table.head(14)

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [32]:
d3.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####